jonlamb-gh/stm32f4xx-hal/src/dma.rs
//! Direct Memory Access.
//!
//!
//! # Status
//! This implementation currently only provides convenience methods for configuration and clearing of interrupts. No attempt has been made
//! (yet) to provide a safe api for dealing with buffers or ongoing transfers.
//!
//! DmaStream::init is an attempt at providing compile time checking of peripheral-stream-channel-direction combinations.
//! DmaStream::init is implemented for valid combinations. [DmaStream](struct.DmaStream.html) shows a list of valid combinations.
//! You can also directly configure the DMA via the StreamX<DMA> structs but this won't give you any protection from invalid combinations.
//!
//! ## Implemented and tested
//! * ADC
//!     * Single conversion
//!     * Sequence conversions
//!     * Circular mode
//!     * Double buffer
//! ## Implemented but need further testing
//! * Features
//!     * SxCR.PFCTRL - peripheral flow control
//! * Peripherals
//!     * TIM - Timers support dozens of DMA modes. Might be a nice idea to implement the "arbitrary waveform generator" from AN4776 as a demo.
//!     * CRYP
//!     * HASH
//!     * UART
//!     * USART
//!     * SPI
//!     * I2C
//!     * DCMI
//!     * QUADSPI
//! ## Not implemented
//! * SDIO
//! * DAC
//! * AES
//! * SAI
//! * FMPI2C1
//! * DFSDM*
//! * SPDIFRX
//! * TIM6/7 - lots of devices missing DMAR register, not sure if this is an SVD issue or dma works differently on those devices.
//!
//! # Examples
//! ## ADC sequence
//! ```
//! static mut ADC_DMA_BUFFER1: [u16; 3] = [0; 3]
//! static mut ADC_DMA_BUFFER2: [u16; 3] = [0; 3]
//! fn main() {
//!     let adc_config = AdcConfig::default()
//!         .scan(Scan::Enabled)
//!         .dma(Dma::Continuous);
//!
//!     let dma_config = DmaConfig::default()
//!         .circular(true)
//!         .transfer_complete_interrupt(true)
//!         .double_buffer(true);
//!
//!     unsafe {
//!         let dma_stream = DmaStream::<DMA2, Stream0<DMA2>, Channel0, ADC1, PeripheralToMemory>::init(
//!             &mut device.DMA2,
//!             &device.ADC1,
//!             &ADC_DMA_BUFFER1 as &[u16],
//!             Some(&ADC_DMA_BUFFER2 as &[u16]),
//!             dma_config);
//!         //you can keep the returned dma_stream reference around for updating config/clearing interrupts/etc.
//!     }
//!
//!     let mut adc = Adc::adc1(device.ADC1, true, adc_config);
//!     //... configure sequence ...
//!     adc.start_conversion();
//! }
//!
//! #[interrupt]
//! fn DMA2_STREAM0() {
//!     //... get dma_stream and the dma peripheral from where we stashed them (resources if using rtfm, a static if not) ...
//!     let cb = dma_stream.current_buffer(dma);
//!     dma_stream.clear_interrupts(dma);
//!
//!     //If we didn't keep the DmaStream around, can use this instead
//!     unsafe {
//!         Stream0::<DMA2>::clear_interrupts_unsafe();
//!     }
//!
//!     info!("DMA: {:?} {:?} {:?}", cb, ADC_DMA_BUFFER1, ADC_DMA_BUFFER2);
//! }
//! ```

// NOTE: modified copy of https://github.com/cs2dsb/stm32f4xx-hal/tree/dma

#![warn(missing_docs)]

use crate::stm32;
use core::{marker::PhantomData, ops::Deref};

#[derive(Debug, Clone, Copy, PartialEq)]
enum DmaDirection {
    MemoryToMemory,
    PeripheralToMemory,
    MemoryToPeripheral,
}

/// Converts value to bits for setting a register value
pub trait Bits<T> {
    /// Returns the bit value
    fn bits(self) -> T;
}

/// DMA direction
pub trait Direction: Bits<u8> {}

/// DMA from a peripheral to a memory location
#[derive(Debug, Clone, Copy)]
pub struct PeripheralToMemory;
impl Bits<u8> for PeripheralToMemory {
    fn bits(self) -> u8 {
        0
    }
}
impl Direction for PeripheralToMemory {}
impl PeripheralToMemory {
    fn new() -> Self {
        PeripheralToMemory
    }
    fn direction() -> DmaDirection {
        DmaDirection::PeripheralToMemory
    }
}

/// DMA from one memory location to another memory location
#[derive(Debug, Clone, Copy)]
pub struct MemoryToMemory;
impl Bits<u8> for MemoryToMemory {
    fn bits(self) -> u8 {
        2
    }
}
impl Direction for MemoryToMemory {}
impl MemoryToMemory {
    fn new() -> Self {
        MemoryToMemory
    }
    fn direction() -> DmaDirection {
        DmaDirection::MemoryToMemory
    }
}

/// DMA from a memory location to a peripheral
#[derive(Debug, Clone, Copy)]
pub struct MemoryToPeripheral;
impl Bits<u8> for MemoryToPeripheral {
    fn bits(self) -> u8 {
        1
    }
}
impl Direction for MemoryToPeripheral {}
impl MemoryToPeripheral {
    fn new() -> Self {
        MemoryToPeripheral
    }
    fn direction() -> DmaDirection {
        DmaDirection::MemoryToPeripheral
    }
}

/// DMA Stream
pub struct DmaStream<DMA, STREAM, CHANNEL, PERIPHERAL, DIRECTION> {
    _dma: PhantomData<DMA>,
    _stream: PhantomData<STREAM>,
    _channel: PhantomData<CHANNEL>,
    _peripheral: PhantomData<PERIPHERAL>,
    _direction: PhantomData<DIRECTION>,
}

/// Get an address the DMA can use
pub trait Address {
    /// Returns the address to be used by the DMA stream
    fn address(&self) -> u32;
}

impl Address for &u32 {
    fn address(&self) -> u32 {
        *self as *const _ as u32
    }
}

impl Address for &u16 {
    fn address(&self) -> u32 {
        *self as *const _ as u32
    }
}

impl Address for MemoryToMemory {
    fn address(&self) -> u32 {
        unimplemented!()
    }
}

impl Address for &[u16] {
    fn address(&self) -> u32 {
        self.as_ptr() as *const _ as u32
    }
}

/// Convenience macro for implementing addresses on peripherals
macro_rules! address {
    ($(($peripheral:ty, $register:ident)),+ $(,)*) => {
        $(
            impl Address for $peripheral {
                fn address(&self) -> u32 {
                    &self.$register as *const _ as u32
                }
            }
        )+
    };
}

macro_rules! tim_channels {
    ($(($name:ident, $register:ident)),+ $(,)*) => {
        $(
            /// Wrapper type that indicates which register of the contained timer to use for DMA
            pub struct $name<T> (T);
            impl<T> Deref for $name<T> {
                type Target = T;
                fn deref(&self) -> &T {
                    &self.0
                }
            }
        )+
    };
}

tim_channels!(
    (CCR1, ccr1),
    (CCR2, ccr2),
    (CCR3, ccr3),
    (CCR4, ccr4),
    (DMAR, dmar),
    (ARR, arr),
);

