jonlamb-gh/stm32f4xx-hal/src/dma.rs
/// How full the DMA stream's fifo is
#[derive(Debug, Clone, Copy)]
pub enum FifoLevel {
    /// 0 < fifo_level < 1/4
    GtZeroLtQuarter,
    /// 1/4 <= fifo_level < 1/2
    GteQuarterLtHalf,
    /// 1/2 <= fifo_level < 3/4
    GteHalfLtThreeQuarter,
    /// 3/4 <= fifo_level < full
    GteThreeQuarterLtFull,
    /// Fifo is empty
    Empty,
    /// Fifo is full
    Full,
}

impl From<u8> for FifoLevel {
    fn from(value: u8) -> Self {
        match value {
            0 => FifoLevel::GtZeroLtQuarter,
            1 => FifoLevel::GteQuarterLtHalf,
            2 => FifoLevel::GteHalfLtThreeQuarter,
            3 => FifoLevel::GteThreeQuarterLtFull,
            4 => FifoLevel::Empty,
            5 => FifoLevel::Full,
            _ => unimplemented!(),
        }
    }
}

/// Which DMA buffer is in use
#[derive(Debug, Clone, Copy)]
pub enum CurrentBuffer {
    /// The first buffer (m0ar) is in use
    FirstBuffer,
    /// The second buffer (m1ar) is in use
    DoubleBuffer,
}

/// Stream 0 on the DMA controller
///
/// Can be used directly:
/// ```
/// Stream0<DMA2>::clear_interrupts(dma);
/// ```
///
/// But it is recommended to use DmaStream::init which is only implemented for valid stream-channel-peripheral-direction
/// combinations. Using StreamX directly you can configure invalid peripheral addresses or direction combinations.
pub struct Stream0<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 1 on the DMA controller. See Stream0 for more info.
pub struct Stream1<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 2 on the DMA controller. See Stream0 for more info.
pub struct Stream2<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 3 on the DMA controller. See Stream0 for more info.
pub struct Stream3<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 4 on the DMA controller. See Stream0 for more info.
pub struct Stream4<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 5 on the DMA controller. See Stream0 for more info.
pub struct Stream5<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 6 on the DMA controller. See Stream0 for more info.
pub struct Stream6<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 7 on the DMA controller. See Stream0 for more info.
pub struct Stream7<DMA> {
    _dma: PhantomData<DMA>,
}

/// Macro that creates a struct representing a stream on either DMA controller
/// The implementation does the heavy lifting of mapping to the right fields on the stream
macro_rules! dma_stream {
    ($(($name:ident, $DMA:ty, $st_index:expr, $par:ident, $cr:ident, $m0ar:ident, $m1ar:ident, $ndtr:ident,
        $ifcr:ident, $tcif:ident, $htif:ident, $teif:ident, $dmeif:ident, $feif:ident,
        $fcr:ident)),+ $(,)*) => {
        $(
            #[allow(dead_code)]
            impl $name<$DMA> {
                /// Clear all interrupts for the DMA stream
                pub fn clear_interrupts(dma: &mut $DMA) {
                    dma.$ifcr.write(|w| w
                        .$tcif().set_bit() //Clear transfer complete interrupt flag
                        .$htif().set_bit() //Clear half transfer interrupt flag
                        .$teif().set_bit() //Clear transfer error interrupt flag
                        .$dmeif().set_bit() //Clear direct mode error interrupt flag
                        .$feif().set_bit() //Clear fifo error interrupt flag
                    );
                }

                /// Clear all interrupts by unsafely getting access to the DMA peripheral.
                pub unsafe fn clear_interrupts_unsafe() {
                    let dma = &(*<$DMA>::ptr());
                    dma.$ifcr.write(|w| w
                        .$tcif().set_bit() //Clear transfer complete interrupt flag
                        .$htif().set_bit() //Clear half transfer interrupt flag
                        .$teif().set_bit() //Clear transfer error interrupt flag
                        .$dmeif().set_bit() //Clear direct mode error interrupt flag
                        .$feif().set_bit() //Clear fifo error interrupt flag
                    );
                }

                /// Clear transfer complete interrupt (tcif) for the DMA stream
                pub fn clear_transfer_complete_interrupt(dma: &mut $DMA) {
                    //Clear transfer complete interrupt flag
                    dma.$ifcr.write(|w| w.$tcif().set_bit());
                }

                /// Clear half transfer interrupt (htif) for the DMA stream
                pub fn clear_half_transfer_interrupt(dma: &mut $DMA) {
                    //Clear half transfer interrupt flag
                    dma.$ifcr.write(|w| w.$htif().set_bit());
                }

                /// Clear transfer error interrupt (teif) for the DMA stream
                pub fn clear_transfer_error_interrupt(dma: &mut $DMA) {
                    //Clear transfer error interrupt flag
                    dma.$ifcr.write(|w| w.$teif().set_bit());
                }

                /// Clear direct mode error interrupt (dmeif) for the DMA stream
                pub fn clear_direct_mode_error_interrupt(dma: &mut $DMA) {
                    //Clear direct mode error interrupt flag
                    dma.$ifcr.write(|w| w.$dmeif().set_bit());
                }

                /// Clear fifo error interrupt (feif) for the DMA stream
                pub fn clear_fifo_error_interrupt(dma: &mut $DMA) {
                    //Clear fifo error interrupt flag
                    dma.$ifcr.write(|w| w.$feif().set_bit());
                }

                /// Set the peripheral address (par) for the DMA stream
                pub fn set_peripheral_address(dma: &mut $DMA, value: u32) {
                    dma.st[$st_index].$par.write(|w| w.pa().bits(value));
                }

                /// Set the memory address (m0ar) for the DMA stream
                pub fn set_memory_address(dma: &mut $DMA, value: u32) {
                    dma.st[$st_index].$m0ar.write(|w| w.m0a().bits(value));
                }

                /// Set the double buffer address (m1ar) for the DMA stream
                pub fn set_memory_double_buffer_address(dma: &mut $DMA, value: u32) {
                    dma.st[$st_index].$m1ar.write(|w| w.m1a().bits(value));
                }

                /// Set the number of transfers (ndt) for the DMA stream
                pub fn set_number_of_transfers(dma: &mut $DMA, value: u16) {
                    dma.st[$st_index].$ndtr.write(|w| w.ndt().bits(value));
                }

                /// Enable the DMA stream
                pub fn enable(dma: &mut $DMA) {
                    dma.st[$st_index].$cr.modify(|_, w| w.en().set_bit());
                }

