jonlamb-gh/stm32f4xx-hal/src/dma.rs
                /// Is the DMA stream enabled?
                pub fn is_enabled(dma: &$DMA) -> bool {
                    dma.st[$st_index].$cr.read().en().bit_is_set()
                }

                /// Disable the DMA stream
                pub fn disable(dma: &mut $DMA) {
                    dma.st[$st_index].$cr.modify(|_, w| w.en().clear_bit());
                }

                /// Set the channel for the (chsel) the DMA stream
                pub fn set_channel<C>(dma: &mut $DMA, channel: C)
                where
                    C: Channel,
                {
                    //Some device crates have this field unsafe, others don't.
                    #[allow(unused_unsafe)]
                    dma.st[$st_index].$cr.modify(|_, w| unsafe { w.chsel().bits(channel.bits()) });
                }

                /// Set the priority (pl) the DMA stream
                pub fn set_priority(dma: &mut $DMA, priority: config::Priority) {
                    dma.st[$st_index].$cr.modify(|_, w| w.pl().bits(priority.bits()));
                }

                /// Set the memory size (msize) for the DMA stream
                pub fn set_memory_size(dma: &mut $DMA, size: config::TransferSize) {
                    dma.st[$st_index].$cr.modify(|_, w| unsafe { w.msize().bits(size.bits()) });
                }

                /// Set the peripheral size (psize) for the DMA stream
                pub fn set_peripheral_size(dma: &mut $DMA, size: config::TransferSize) {
                    dma.st[$st_index].$cr.modify(|_, w| unsafe { w.psize().bits(size.bits()) });
                }

                /// Enable/disable memory increment (minc) for the DMA stream
                pub fn set_memory_increment(dma: &mut $DMA, increment: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.minc().bit(increment));
                }

                /// Enable/disable peripheral increment (pinc) for the DMA stream
                pub fn set_peripheral_increment(dma: &mut $DMA, increment: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.pinc().bit(increment));
                }

                /// Enable/disable circular mode (circ) for the DMA stream
                pub fn set_circular(dma: &mut $DMA, circular: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.circ().bit(circular));
                }

                /// Set the direction (dir) of the DMA stream
                pub fn set_direction<D>(dma: &mut $DMA, direction: D)
                where
                    D: Direction,
                {
                    dma.st[$st_index].$cr.modify(|_, w| unsafe { w.dir().bits(direction.bits()) });
                }

                /// Convenience method to configure the 4 common interrupts for the DMA stream
                pub fn set_interrupts(dma: &mut $DMA, transfer_complete: bool, half_transfer: bool, transfer_error: bool, direct_mode_error: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w
                        .tcie().bit(transfer_complete)
                        .htie().bit(half_transfer)
                        .teie().bit(transfer_error)
                        .dmeie().bit(direct_mode_error)
                    );
                }

                /// Enable/disable the transfer complete interrupt (tcie) of the DMA stream
                pub fn set_transfer_complete_interrupt(dma: &mut $DMA, transfer_complete_interrupt: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.tcie().bit(transfer_complete_interrupt));
                }

                /// Enable/disable the half transfer interrupt (htie) of the DMA stream
                pub fn set_half_transfer_interrupt(dma: &mut $DMA, half_transfer_interrupt: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.htie().bit(half_transfer_interrupt));
                }

                /// Enable/disable the transfer error interrupt (teie) of the DMA stream
                pub fn set_transfer_error_interrupt(dma: &mut $DMA, transfer_error_interrupt: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.teie().bit(transfer_error_interrupt));
                }

                /// Enable/disable the direct mode error interrupt (dmeie) of the DMA stream
                pub fn set_direct_mode_error_interrupt(dma: &mut $DMA, direct_mode_error_interrupt: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.dmeie().bit(direct_mode_error_interrupt));
                }

                /// Enable/disable the fifo error interrupt (feie) of the DMA stream
                pub fn set_fifo_error_interrupt(dma: &mut $DMA, fifo_error_interrupt: bool) {
                    dma.st[$st_index].$fcr.modify(|_, w| w.feie().bit(fifo_error_interrupt));
                }

                /// Enable/disable the double buffer (dbm) of the DMA stream
                pub fn set_double_buffer(dma: &mut $DMA, double_buffer: bool) {
                    dma.st[$st_index].$cr.modify(|_, w| w.dbm().bit(double_buffer));
                }

                /// Set the fifo threshold (fcr.fth) of the DMA stream
                pub fn set_fifo_threshold(dma: &mut $DMA, fifo_threshold: config::FifoThreshold) {
                    dma.st[$st_index].$fcr.modify(|_, w| w.fth().bits(fifo_threshold.bits()));
                }

                /// Enable/disable the fifo (dmdis) of the DMA stream
                pub fn set_fifo_enable(dma: &mut $DMA, fifo_enable: bool) {
                    //Register is actually direct mode disable rather than fifo enable
                    dma.st[$st_index].$fcr.modify(|_, w| w.dmdis().bit(!fifo_enable));
                }

                /// Set memory burst mode (mburst) of the DMA stream
                pub fn set_memory_burst(dma: &mut $DMA, memory_burst: config::BurstMode) {
                    dma.st[$st_index].$cr.modify(|_, w| w.mburst().bits(memory_burst.bits()));
                }

                /// Set peripheral burst mode (pburst) of the DMA stream
                pub fn set_peripheral_burst(dma: &mut $DMA, peripheral_burst: config::BurstMode) {
                    dma.st[$st_index].$cr.modify(|_, w| w.pburst().bits(peripheral_burst.bits()));
                }

                /// Get the current fifo level (fs) of the DMA stream
                pub fn fifo_level(dma: &$DMA) -> FifoLevel {
                    dma.st[$st_index].$fcr.read().fs().bits().into()
                }

                /// Set the flow controller (pfctrl) of the DMA stream
                pub fn set_flow_controller(dma: &mut $DMA, flow_controller: config::FlowController) {
                    dma.st[$st_index].$cr.modify(|_, w| w.pfctrl().bit(flow_controller.bits()));
                }

