jonlamb-gh/stm32f4xx-hal/src/dma.rs
                /// Get which buffer is currently in use
                pub fn current_buffer(dma: &$DMA) -> CurrentBuffer {
                    if dma.st[$st_index].$cr.read().ct().bit_is_set() {
                        CurrentBuffer::DoubleBuffer
                    } else {
                        CurrentBuffer::FirstBuffer
                    }
                }
            }
        )+
    };
}

dma_stream!(
    (
        Stream0,
        stm32::DMA1,
        0,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif0,
        chtif0,
        cteif0,
        cdmeif0,
        cfeif0,
        fcr
    ),
    (
        Stream0,
        stm32::DMA2,
        0,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif0,
        chtif0,
        cteif0,
        cdmeif0,
        cfeif0,
        fcr
    ),
    (
        Stream1,
        stm32::DMA1,
        1,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif1,
        chtif1,
        cteif1,
        cdmeif1,
        cfeif1,
        fcr
    ),
    (
        Stream1,
        stm32::DMA2,
        1,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif1,
        chtif1,
        cteif1,
        cdmeif1,
        cfeif1,
        fcr
    ),
    (
        Stream2,
        stm32::DMA1,
        2,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif2,
        chtif2,
        cteif2,
        cdmeif2,
        cfeif2,
        fcr
    ),
    (
        Stream2,
        stm32::DMA2,
        2,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif2,
        chtif2,
        cteif2,
        cdmeif2,
        cfeif2,
        fcr
    ),
    (
        Stream3,
        stm32::DMA1,
        3,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif3,
        chtif3,
        cteif3,
        cdmeif3,
        cfeif3,
        fcr
    ),
    (
        Stream3,
        stm32::DMA2,
        3,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        lifcr,
        ctcif3,
        chtif3,
        cteif3,
        cdmeif3,
        cfeif3,
        fcr
    ),
    (
        Stream4,
        stm32::DMA1,
        4,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif4,
        chtif4,
        cteif4,
        cdmeif4,
        cfeif4,
        fcr
    ),
    (
        Stream4,
        stm32::DMA2,
        4,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif4,
        chtif4,
        cteif4,
        cdmeif4,
        cfeif4,
        fcr
    ),
    (
        Stream5,
        stm32::DMA1,
        5,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif5,
        chtif5,
        cteif5,
        cdmeif5,
        cfeif5,
        fcr
    ),
    (
        Stream5,
        stm32::DMA2,
        5,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif5,
        chtif5,
        cteif5,
        cdmeif5,
        cfeif5,
        fcr
    ),
    (
        Stream6,
        stm32::DMA1,
        6,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif6,
        chtif6,
        cteif6,
        cdmeif6,
        cfeif6,
        fcr
    ),
    (
        Stream6,
        stm32::DMA2,
        6,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif6,
        chtif6,
        cteif6,
        cdmeif6,
        cfeif6,
        fcr
    ),
    (
        Stream7,
        stm32::DMA1,
        7,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif7,
        chtif7,
        cteif7,
        cdmeif7,
        cfeif7,
        fcr
    ),
    (
        Stream7,
        stm32::DMA2,
        7,
        par,
        cr,
        m0ar,
        m1ar,
        ndtr,
        hifcr,
        ctcif7,
        chtif7,
        cteif7,
        cdmeif7,
        cfeif7,
        fcr
    ),
);

/// A channel that can be configured on a DMA stream
pub trait Channel: Bits<u8> {}

/// Macro that defines a channel and it's conversion to u8
macro_rules! dma_channel {
    ($(($name:ident, $value:expr)),+ $(,)*) => {
        $(
            /// A Channel that can be configured on a DMA stream
            #[derive(Debug, Clone, Copy)]
            pub struct $name;
            impl Bits<u8> for $name {
                fn bits(self) -> u8 { $value }
            }
            impl Channel for $name {}
            impl $name {
                fn new() -> Self {
                    $name
                }
            }
        )+
    };
}

dma_channel!(
    (Channel0, 0),
    (Channel1, 1),
    (Channel2, 2),
    (Channel3, 3),
    (Channel4, 4),
    (Channel5, 5),
    (Channel6, 6),
    (Channel7, 7),
);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_channel!((Channel8, 8), (Channel9, 9),);

/// Things that implement this can have their RCC enabled
trait RccEnable {
    fn rcc_enable();
}

impl RccEnable for stm32::DMA1 {
    fn rcc_enable() {
        unsafe {
            let rcc = &(*stm32::RCC::ptr());
            rcc.ahb1enr.modify(|_, w| w.dma1en().set_bit());
        }
    }
}

impl RccEnable for stm32::DMA2 {
    fn rcc_enable() {
        unsafe {
            let rcc = &(*stm32::RCC::ptr());
            rcc.ahb1enr.modify(|_, w| w.dma2en().set_bit());
        }
    }
}

/// Contains types related to DMA configuration
pub mod config {
    use super::Bits;

    /// Priority of the DMA stream. Defaults to Medium. Deadlocks are resolved by
    /// the lower numbered stream gets priority.
    #[derive(Debug, Clone, Copy)]
    pub enum Priority {
        /// Low priority
        Low,
        /// Medium priority
        Medium,
        /// High priority
        High,
        /// Very high priority
        VeryHigh,
    }

    impl Bits<u8> for Priority {
        fn bits(self) -> u8 {
            match self {
                Priority::Low => 0,
                Priority::Medium => 1,
                Priority::High => 2,
                Priority::VeryHigh => 3,
            }
        }
    }

    /// Size of the transfer. Same type for memory and peripheral size but the values
    /// needn't be the same. Check the datasheet for how byte packing/unpacking works.
    #[derive(Debug, Clone, Copy)]
    pub enum TransferSize {
        /// 8-bit
        Byte,
        /// 16-bit
        HalfWord,
        /// 32-bit
        Word,
    }

    impl Bits<u8> for TransferSize {
        fn bits(self) -> u8 {
            match self {
                TransferSize::Byte => 0,
                TransferSize::HalfWord => 1,
                TransferSize::Word => 2,
            }
        }
    }

