jonlamb-gh/stm32f4xx-hal/src/dma.rs
    /// The level to fill the fifo to before performing the transaction
    #[derive(Debug, Clone, Copy)]
    pub enum FifoThreshold {
        /// 1/4 full
        QuarterFull,
        /// 1/2 full
        HalfFull,
        /// 3/4 full
        ThreeQuarterFull,
        /// Full
        Full,
    }

    impl Bits<u8> for FifoThreshold {
        fn bits(self) -> u8 {
            match self {
                FifoThreshold::QuarterFull => 0,
                FifoThreshold::HalfFull => 1,
                FifoThreshold::ThreeQuarterFull => 2,
                FifoThreshold::Full => 3,
            }
        }
    }

    /// How burst transfers are done. Requires fifo enabled. Check datasheet for valid combinations.
    #[derive(Debug, Clone, Copy)]
    pub enum BurstMode {
        /// Single transfer, no burst
        NoBurst,
        /// Burst transfer of 4 beats
        Burst4,
        /// Burst transfer of 8 beats
        Burst8,
        /// Burst transfer of 16 beats
        Burst16,
    }

    impl Bits<u8> for BurstMode {
        fn bits(self) -> u8 {
            match self {
                BurstMode::NoBurst => 0,
                BurstMode::Burst4 => 1,
                BurstMode::Burst8 => 2,
                BurstMode::Burst16 => 3,
            }
        }
    }

    /// Is the DMA controller the flow controller or is the peripheral?
    #[derive(Debug, Clone, Copy)]
    pub enum FlowController {
        /// DMA controller is the flow controller
        Dma,
        /// Source or destination peripheral is the flow controller
        Peripheral,
    }

    impl Bits<bool> for FlowController {
        fn bits(self) -> bool {
            match self {
                FlowController::Dma => false,
                FlowController::Peripheral => true,
            }
        }
    }

    /// Contains the complete set of configuration for a DMA stream
    #[derive(Debug, Clone, Copy)]
    pub struct DmaConfig {
        pub(crate) memory_size: TransferSize,
        pub(crate) peripheral_size: TransferSize,
        pub(crate) number_of_transfers: u16,
        pub(crate) priority: Priority,
        pub(crate) memory_increment: bool,
        pub(crate) peripheral_increment: bool,
        pub(crate) circular: bool,
        pub(crate) transfer_complete_interrupt: bool,
        pub(crate) half_transfer_interrupt: bool,
        pub(crate) transfer_error_interrupt: bool,
        pub(crate) direct_mode_error_interrupt: bool,
        pub(crate) fifo_error_interrupt: bool,
        pub(crate) double_buffer: bool,
        pub(crate) fifo_threshold: FifoThreshold,
        pub(crate) fifo_enable: bool,
        pub(crate) memory_burst: BurstMode,
        pub(crate) peripheral_burst: BurstMode,
        pub(crate) flow_controller: FlowController,
    }

    impl Default for DmaConfig {
        fn default() -> Self {
            Self {
                memory_size: TransferSize::HalfWord,
                peripheral_size: TransferSize::HalfWord,
                number_of_transfers: 1,
                priority: Priority::Medium,
                memory_increment: false,
                peripheral_increment: false,
                circular: false,
                transfer_complete_interrupt: false,
                half_transfer_interrupt: false,
                transfer_error_interrupt: false,
                direct_mode_error_interrupt: false,
                fifo_error_interrupt: false,
                double_buffer: false,
                fifo_threshold: FifoThreshold::QuarterFull,
                fifo_enable: false,
                memory_burst: BurstMode::NoBurst,
                peripheral_burst: BurstMode::NoBurst,
                flow_controller: FlowController::Dma,
            }
        }
    }

    impl DmaConfig {
        /// Set the memory_size
        pub fn memory_size(mut self, memory_size: TransferSize) -> Self {
            self.memory_size = memory_size;
            self
        }
        /// Set the peripheral_size
        pub fn peripheral_size(mut self, peripheral_size: TransferSize) -> Self {
            self.peripheral_size = peripheral_size;
            self
        }
        /// Set the number_of_transfers
        pub fn number_of_transfers(mut self, number_of_transfers: u16) -> Self {
            self.number_of_transfers = number_of_transfers;
            self
        }
        /// Set the priority
        pub fn priority(mut self, priority: Priority) -> Self {
            self.priority = priority;
            self
        }
        /// Set the memory_increment
        pub fn memory_increment(mut self, memory_increment: bool) -> Self {
            self.memory_increment = memory_increment;
            self
        }
        /// Set the peripheral_increment
        pub fn peripheral_increment(mut self, peripheral_increment: bool) -> Self {
            self.peripheral_increment = peripheral_increment;
            self
        }
        /// Set the circular
        pub fn circular(mut self, circular: bool) -> Self {
            self.circular = circular;
            self
        }
        /// Set the transfer_complete_interrupt
        pub fn transfer_complete_interrupt(mut self, transfer_complete_interrupt: bool) -> Self {
            self.transfer_complete_interrupt = transfer_complete_interrupt;
            self
        }
        /// Set the half_transfer_interrupt
        pub fn half_transfer_interrupt(mut self, half_transfer_interrupt: bool) -> Self {
            self.half_transfer_interrupt = half_transfer_interrupt;
            self
        }
        /// Set the transfer_error_interrupt
        pub fn transfer_error_interrupt(mut self, transfer_error_interrupt: bool) -> Self {
            self.transfer_error_interrupt = transfer_error_interrupt;
            self
        }
        /// Set the direct_mode_error_interrupt
        pub fn direct_mode_error_interrupt(mut self, direct_mode_error_interrupt: bool) -> Self {
            self.direct_mode_error_interrupt = direct_mode_error_interrupt;
            self
        }
        /// Set the fifo_error_interrupt
        pub fn fifo_error_interrupt(mut self, fifo_error_interrupt: bool) -> Self {
            self.fifo_error_interrupt = fifo_error_interrupt;
            self
        }
        /// Set the double_buffer
        pub fn double_buffer(mut self, double_buffer: bool) -> Self {
            self.double_buffer = double_buffer;
            self
        }
        /// Set the fifo_threshold
        pub fn fifo_threshold(mut self, fifo_threshold: FifoThreshold) -> Self {
            self.fifo_threshold = fifo_threshold;
            self
        }
        /// Set the fifo_enable
        pub fn fifo_enable(mut self, fifo_enable: bool) -> Self {
            self.fifo_enable = fifo_enable;
            self
        }
        /// Set the memory_burst
        pub fn memory_burst(mut self, memory_burst: BurstMode) -> Self {
            self.memory_burst = memory_burst;
            self
        }
        /// Set the peripheral_burst
        pub fn peripheral_burst(mut self, peripheral_burst: BurstMode) -> Self {
            self.peripheral_burst = peripheral_burst;
            self
        }
        /// Set the flow_controller
        pub fn flow_controller(mut self, flow_controller: FlowController) -> Self {
            self.flow_controller = flow_controller;
            self
        }
    }
}

macro_rules! dma_map {
    ($(($DMA:ty, $stream:ident, $channel:ty, $peripheral:ty, $dir:ty)),+ $(,)*) => {
        $(
            impl DmaStream<$DMA, $stream<$DMA>, $channel, $peripheral, $dir> {
                /// Change the priority of the DMA stream
                pub fn set_priority(&self, dma: &mut $DMA, priority: config::Priority) {
                    <$stream<$DMA>>::set_priority(dma, priority);
                }

                /// Clear all interrupts on the DMA stream
                pub fn clear_interrupts(&self, dma: &mut $DMA) {
                    <$stream<$DMA>>::clear_interrupts(dma);
                }

                /// Disable the stream
                pub fn disable(&self, dma: &mut $DMA) {
                    <$stream<$DMA>>::disable(dma);
                }

                /// Enable the stream
                pub fn enable(&self, dma: &mut $DMA) {
                    <$stream<$DMA>>::enable(dma);
                }

