jonlamb-gh/stm32f4xx-hal/src/dma.rs
                /// Is the stream enabled?
                pub fn is_enabled(&self, dma: &mut $DMA) -> bool{
                    <$stream<$DMA>>::is_enabled(dma)
                }

                /// Change the memory size of the DMA stream
                pub fn set_memory_size(&self, dma: &mut $DMA, size: config::TransferSize) {
                    <$stream<$DMA>>::set_memory_size(dma, size);
                }

                /// Change the peripheral size of the DMA stream
                pub fn set_peripheral_size(&self, dma: &mut $DMA, size: config::TransferSize) {
                    <$stream<$DMA>>::set_peripheral_size(dma, size);
                }

                /// Change the number of transfers of the DMA stream
                pub fn set_number_of_transfers(&self, dma: &mut $DMA, number_of_transfers: u16) {
                    <$stream<$DMA>>::set_number_of_transfers(dma, number_of_transfers);
                }

                /// Enable/disable memory increment of the DMA stream
                pub fn set_memory_increment(&self, dma: &mut $DMA, memory_increment: bool) {
                    <$stream<$DMA>>::set_memory_increment(dma, memory_increment);
                }

                /// Enable/disable peripheral increment of the DMA stream
                pub fn set_peripheral_increment(&self, dma: &mut $DMA, peripheral_increment: bool) {
                    <$stream<$DMA>>::set_peripheral_increment(dma, peripheral_increment);
                }

                /// Enable/disable circular mode of the DMA stream
                pub fn set_circular(&self, dma: &mut $DMA, circular: bool) {
                    <$stream<$DMA>>::set_circular(dma, circular);
                }

                /// Enable/disable the transfer complete interrupt of the DMA stream
                pub fn set_transfer_complete_interrupt(&self, dma: &mut $DMA, transfer_complete_interrupt: bool) {
                    <$stream<$DMA>>::set_transfer_complete_interrupt(dma, transfer_complete_interrupt);
                }

                /// Enable/disable the half transfer interrupt of the DMA stream
                pub fn set_half_transfer_interrupt(&self, dma: &mut $DMA, half_transfer_interrupt: bool) {
                    <$stream<$DMA>>::set_half_transfer_interrupt(dma, half_transfer_interrupt);
                }

                /// Enable/disable the transfer error interrupt of the DMA stream
                pub fn set_transfer_error_interrupt(&self, dma: &mut $DMA, transfer_error_interrupt: bool) {
                    <$stream<$DMA>>::set_transfer_error_interrupt(dma, transfer_error_interrupt);
                }

                /// Enable/disable the direct mode error interrupt of the DMA stream
                pub fn set_direct_mode_error_interrupt(&self, dma: &mut $DMA, direct_mode_error_interrupt: bool) {
                    <$stream<$DMA>>::set_direct_mode_error_interrupt(dma, direct_mode_error_interrupt);
                }

                /// Enable/disable the fifo error interrupt of the DMA stream
                pub fn set_fifo_error_interrupt(&self, dma: &mut $DMA, fifo_error_interrupt: bool) {
                    <$stream<$DMA>>::set_fifo_error_interrupt(dma, fifo_error_interrupt);
                }

                /// Enable/disable the double buffer of the DMA stream
                pub fn set_double_buffer(&self, dma: &mut $DMA, double_buffer: bool) {
                    <$stream<$DMA>>::set_double_buffer(dma, double_buffer);
                }

                /// Change the fifo threshold of the DMA stream
                pub fn set_fifo_threshold(&self, dma: &mut $DMA, fifo_threshold: config::FifoThreshold) {
                    <$stream<$DMA>>::set_fifo_threshold(dma, fifo_threshold);
                }

                /// Enable/disable the fifo of the DMA stream
                pub fn set_fifo_enable(&self, dma: &mut $DMA, fifo_enable: bool) {
                    <$stream<$DMA>>::set_fifo_enable(dma, fifo_enable);
                }

                /// Change memory burst mode of the DMA stream
                pub fn set_memory_burst(&self, dma: &mut $DMA, memory_burst: config::BurstMode) {
                    <$stream<$DMA>>::set_memory_burst(dma, memory_burst);
                }

                /// Change the peripheral burst mode of the DMA stream
                pub fn set_peripheral_burst(&self, dma: &mut $DMA, peripheral_burst: config::BurstMode) {
                    <$stream<$DMA>>::set_peripheral_burst(dma, peripheral_burst);
                }

                /// Get the current fifo level of the DMA stream
                pub fn fifo_level(&self, dma: &mut $DMA) -> FifoLevel {
                    <$stream<$DMA>>::fifo_level(dma)
                }

                /// Set the flow controller of the DMA stream
                pub fn set_flow_controller(&self, dma: &mut $DMA, flow_controller: config::FlowController) {
                    <$stream<$DMA>>::set_flow_controller(dma, flow_controller);
                }

                /// Get the current buffer the DMA stream is using
                pub fn current_buffer(&self, dma: &$DMA) -> CurrentBuffer {
                    <$stream<$DMA>>::current_buffer(dma)
                }

                /// Applies all fields in DmaConfig
                pub fn apply_config(&self, dma: &mut $DMA, config: config::DmaConfig) {
                    let was_enabled = self.is_enabled(dma);
                    if was_enabled {
                        self.disable(dma);
                    }

                    self.clear_interrupts(dma);
                    self.set_priority(dma, config.priority);
                    self.set_memory_size(dma, config.memory_size);
                    self.set_peripheral_size(dma, config.peripheral_size);
                    self.set_memory_increment(dma, config.memory_increment);
                    self.set_peripheral_increment(dma, config.peripheral_increment);
                    self.set_circular(dma, config.circular);
                    self.set_transfer_complete_interrupt(dma, config.transfer_complete_interrupt);
                    self.set_half_transfer_interrupt(dma, config.half_transfer_interrupt);
                    self.set_transfer_error_interrupt(dma, config.transfer_error_interrupt);
                    self.set_direct_mode_error_interrupt(dma, config.direct_mode_error_interrupt);
                    self.set_fifo_error_interrupt(dma, config.fifo_error_interrupt);
                    self.set_number_of_transfers(dma, config.number_of_transfers);
                    self.set_double_buffer(dma, config.double_buffer);
                    self.set_fifo_threshold(dma, config.fifo_threshold);
                    self.set_fifo_enable(dma, config.fifo_enable);
                    self.set_memory_burst(dma, config.memory_burst);
                    self.set_peripheral_burst(dma, config.peripheral_burst);
                    self.set_flow_controller(dma, config.flow_controller);

