jonlamb-gh/stm32f4xx-hal/src/dma.rs
                    if was_enabled {
                        self.enable(dma);
                    }
                }

                /// Configures DMA stream to correct channel for peripheral, configures source and destination addresses and applies supplied config
                pub fn init<MA>(dma: &mut $DMA, peripheral: &$peripheral, memory: MA, double_buffer: Option<MA>, config: config::DmaConfig) -> Self
                where
                    MA: Address,
                {
                    //Enable RCC
                    <$DMA>::rcc_enable();

                    let s = Self {
                        _dma: PhantomData,
                        _stream: PhantomData,
                        _channel: PhantomData,
                        _peripheral: PhantomData,
                        _direction: PhantomData,
                    };

                    s.disable(dma);

                    //Set the channel
                    <$stream<$DMA>>::set_channel(dma, <$channel>::new());

                    //Set peripheral to memory mode
                    <$stream<$DMA>>::set_direction(dma, <$dir>::new());

                    //Set the memory address
                    <$stream<$DMA>>::set_memory_address(dma, memory.address());

                    let is_mem2mem = <$dir>::direction() == DmaDirection::MemoryToMemory;
                    if is_mem2mem {
                        //Fifo must be enabled for memory to memory
                        assert!(config.fifo_enable);
                    } else {
                        //Set the peripheral address
                        <$stream<$DMA>>::set_peripheral_address(dma, peripheral.address());
                    }

                    if let Some(db) = double_buffer {
                        if is_mem2mem {
                            //Double buffer is the source in mem2mem mode
                            <$stream<$DMA>>::set_peripheral_address(dma, db.address());
                        } else {
                            <$stream<$DMA>>::set_memory_double_buffer_address(dma, db.address());
                        }
                    } else {
                        // Double buffer mode must not be enabled if we haven't been given a second buffer
                        assert!(!config.double_buffer);
                    }

                    s.apply_config(dma, config);
                    s.enable(dma);

                    s
                }
            }
        )+
    };
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream0,
        Channel2,
        CCR1<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH1
    (
        stm32::DMA1,
        Stream0,
        Channel2,
        CCR1<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH1
    (
        stm32::DMA1,
        Stream2,
        Channel5,
        CCR4<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH4
    (
        stm32::DMA1,
        Stream2,
        Channel5,
        CCR4<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH4
    (
        stm32::DMA1,
        Stream2,
        Channel5,
        DMAR<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_UP
    (
        stm32::DMA1,
        Stream2,
        Channel5,
        DMAR<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_UP
    (
        stm32::DMA1,
        Stream3,
        Channel2,
        CCR2<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH2
    (
        stm32::DMA1,
        Stream3,
        Channel2,
        CCR2<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH2
    (
        stm32::DMA1,
        Stream4,
        Channel5,
        CCR1<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH1
    (
        stm32::DMA1,
        Stream4,
        Channel5,
        CCR1<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH1
    (
        stm32::DMA1,
        Stream4,
        Channel5,
        DMAR<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_TRIG
    (
        stm32::DMA1,
        Stream4,
        Channel5,
        DMAR<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_TRIG
    (
        stm32::DMA1,
        Stream5,
        Channel3,
        CCR1<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH1
    (
        stm32::DMA1,
        Stream5,
        Channel3,
        CCR1<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH1
    (
        stm32::DMA1,
        Stream5,
        Channel5,
        CCR2<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH2
    (
        stm32::DMA1,
        Stream5,
        Channel5,
        CCR2<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH2
    (
        stm32::DMA1,
        Stream6,
        Channel2,
        DMAR<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_UP
    (
        stm32::DMA1,
        Stream6,
        Channel2,
        DMAR<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_UP
    (
        stm32::DMA1,
        Stream6,
        Channel3,
        CCR2<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH2
    (
        stm32::DMA1,
        Stream6,
        Channel3,
        CCR2<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH2
    (
        stm32::DMA1,
        Stream6,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        stm32::DMA1,
        Stream6,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        stm32::DMA1,
        Stream7,
        Channel2,
        CCR3<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH3
    (
        stm32::DMA1,
        Stream7,
        Channel2,
        CCR3<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH3
    (
        stm32::DMA1,
        Stream7,
        Channel5,
        CCR3<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH3
    (
        stm32::DMA1,
        Stream7,
        Channel5,
        CCR3<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH3
    (
        stm32::DMA1,
        Stream0,
        Channel0,
        stm32::SPI3,
        PeripheralToMemory
    ), //SPI3_RX
    (
        stm32::DMA1,
        Stream2,
        Channel0,
        stm32::SPI3,
        PeripheralToMemory
    ), //SPI3_RX
    (
        stm32::DMA1,
        Stream4,
        Channel3,
        stm32::I2C3,
        MemoryToPeripheral
    ), //I2C3_TX
    (
        stm32::DMA1,
        Stream5,
        Channel0,
        stm32::SPI3,
        MemoryToPeripheral
    ), //SPI3_TX
    (
        stm32::DMA1,
        Stream7,
        Channel0,
        stm32::SPI3,
        MemoryToPeripheral
    ), //SPI3_TX
       //(stm32::DMA2, Stream3, Channel4, stm32::SDIO, MemoryToPeripheral), //SDIO
       //(stm32::DMA2, Stream3, Channel4, stm32::SDIO, PeripheralToMemory), //SDIO
       //(stm32::DMA2, Stream6, Channel4, stm32::SDIO, MemoryToPeripheral), //SDIO
       //(stm32::DMA2, Stream6, Channel4, stm32::SDIO, PeripheralToMemory), //SDIO
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM4>, ccr1),
    (CCR4<stm32::TIM3>, ccr4),
    (CCR1<stm32::TIM2>, ccr1),
    (CCR1<stm32::TIM3>, ccr1),
    (CCR2<stm32::TIM2>, ccr2),
    (CCR2<stm32::TIM3>, ccr2),
    (CCR2<stm32::TIM4>, ccr2),
    (CCR3<stm32::TIM3>, ccr3),
    (CCR3<stm32::TIM4>, ccr3),
    (CCR4<stm32::TIM2>, ccr4),
    (DMAR<stm32::TIM3>, dmar),
    (DMAR<stm32::TIM4>, dmar),
    (stm32::SPI3, dr),
    (stm32::I2C3, dr),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream0,
        Channel6,
        CCR3<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH3
    (
        stm32::DMA1,
        Stream0,
        Channel6,
        CCR3<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH3
    (
        stm32::DMA1,
        Stream0,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_UP
    (
        stm32::DMA1,
        Stream0,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_UP
    (
        stm32::DMA1,
        Stream1,
        Channel6,
        CCR4<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH4
    (
        stm32::DMA1,
        Stream1,
        Channel6,
        CCR4<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH4
    (
        stm32::DMA1,
        Stream1,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_TRIG
    (
        stm32::DMA1,
        Stream1,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_TRIG
    (
        stm32::DMA1,
        Stream2,
        Channel6,
        CCR1<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH1
    (
        stm32::DMA1,
        Stream2,
        Channel6,
        CCR1<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH1
    (
        stm32::DMA1,
        Stream3,
        Channel6,
        CCR4<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH4
    (
        stm32::DMA1,
        Stream3,
        Channel6,
        CCR4<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH4
    (
        stm32::DMA1,
        Stream3,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_TRIG
    (
        stm32::DMA1,
        Stream3,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_TRIG
    (
        stm32::DMA1,
        Stream4,
        Channel6,
        CCR2<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH2
    (
        stm32::DMA1,
        Stream4,
        Channel6,
        CCR2<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH2
    (
        stm32::DMA1,
        Stream6,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_UP
    (
        stm32::DMA1,
        Stream6,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_UP
    (
        stm32::DMA2,
        Stream0,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_TRIG
    (
        stm32::DMA2,
        Stream0,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_TRIG
    (
        stm32::DMA2,
        Stream1,
        Channel6,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream1,
        Channel6,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream2,
        Channel6,
        CCR2<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH2
    (
        stm32::DMA2,
        Stream2,
        Channel6,
        CCR2<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH2
    (
        stm32::DMA2,
        Stream3,
        Channel6,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream3,
        Channel6,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream4,
        Channel6,
        CCR4<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH4
    (
        stm32::DMA2,
        Stream4,
        Channel6,
        CCR4<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH4
    (
        stm32::DMA2,
        Stream4,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_TRIG/COM
    (
        stm32::DMA2,
        Stream4,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_TRIG/COM
    (
        stm32::DMA2,
        Stream5,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_UP
    (
        stm32::DMA2,
        Stream5,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_UP
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR2<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH2
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR2<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH2
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR3<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH3
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        CCR3<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH3
    (
        stm32::DMA2,
        Stream6,
        Channel6,
        CCR3<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH3
    (
        stm32::DMA2,
        Stream6,
        Channel6,
        CCR3<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH3
    (
        stm32::DMA1,
        Stream0,
        Channel1,
        stm32::I2C1,
        PeripheralToMemory
    ), //I2C1_RX
    (
        stm32::DMA1,
        Stream2,
        Channel7,
        stm32::I2C2,
        PeripheralToMemory
    ), //I2C2_RX
    (
        stm32::DMA1,
        Stream3,
        Channel0,
        stm32::SPI2,
        PeripheralToMemory
    ), //SPI2_RX
    (
        stm32::DMA1,
        Stream3,
        Channel7,
        stm32::I2C2,
        PeripheralToMemory
    ), //I2C2_RX
    (
        stm32::DMA1,
        Stream4,
        Channel0,
        stm32::SPI2,
        MemoryToPeripheral
    ), //SPI2_TX
    (
        stm32::DMA1,
        Stream5,
        Channel1,
        stm32::I2C1,
        PeripheralToMemory
    ), //I2C1_RX
    (
        stm32::DMA1,
        Stream5,
        Channel4,
        stm32::USART2,
        PeripheralToMemory
    ), //USART2_RX
    (
        stm32::DMA1,
        Stream6,
        Channel4,
        stm32::USART2,
        MemoryToPeripheral
    ), //USART2_TX
    (
        stm32::DMA1,
        Stream7,
        Channel7,
        stm32::I2C2,
        MemoryToPeripheral
    ), //I2C2_TX
    (
        stm32::DMA2,
        Stream0,
        Channel0,
        stm32::ADC1,
        PeripheralToMemory
    ), //ADC1
    (
        stm32::DMA2,
        Stream0,
        Channel3,
        stm32::SPI1,
        PeripheralToMemory
    ), //SPI1_RX
    (
        stm32::DMA2,
        Stream1,
        Channel5,
        stm32::USART6,
        PeripheralToMemory
    ), //USART6_RX
    (
        stm32::DMA2,
        Stream2,
        Channel3,
        stm32::SPI1,
        PeripheralToMemory
    ), //SPI1_RX
    (
        stm32::DMA2,
        Stream2,
        Channel4,
        stm32::USART1,
        PeripheralToMemory
    ), //USART1_RX
    (
        stm32::DMA2,
        Stream2,
        Channel5,
        stm32::USART6,
        PeripheralToMemory
    ), //USART6_RX
    (
        stm32::DMA2,
        Stream4,
        Channel0,
        stm32::ADC1,
        PeripheralToMemory
    ), //ADC1
    (
        stm32::DMA2,
        Stream5,
        Channel4,
        stm32::USART1,
        PeripheralToMemory
    ), //USART1_RX
    (
        stm32::DMA2,
        Stream6,
        Channel5,
        stm32::USART6,
        MemoryToPeripheral
    ), //USART6_TX
    (
        stm32::DMA2,
        Stream7,
        Channel4,
        stm32::USART1,
        MemoryToPeripheral
    ), //USART1_TX
    (
        stm32::DMA2,
        Stream7,
        Channel5,
        stm32::USART6,
        MemoryToPeripheral
    ), //USART6_TX
    (
        stm32::DMA2,
        Stream0,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream1,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream3,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream4,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream5,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream6,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
    (
        stm32::DMA2,
        Stream7,
        Channel0,
        MemoryToMemory,
        MemoryToMemory
    ),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM1>, ccr1),
    (CCR2<stm32::TIM1>, ccr2),
    (CCR3<stm32::TIM1>, ccr3),
    (CCR4<stm32::TIM1>, ccr4),
    (DMAR<stm32::TIM1>, dmar),
    (CCR1<stm32::TIM5>, ccr1),
    (CCR2<stm32::TIM5>, ccr2),
    (CCR3<stm32::TIM5>, ccr3),
    (CCR4<stm32::TIM5>, ccr4),
    (DMAR<stm32::TIM5>, dmar),
    (stm32::ADC1, dr),
    (stm32::I2C1, dr),
    (stm32::I2C2, dr),
    (stm32::SPI1, dr),
    (stm32::SPI2, dr),
    (stm32::USART1, dr),
    (stm32::USART2, dr),
    (stm32::USART6, dr),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream1,
        Channel1,
        stm32::I2C3,
        PeripheralToMemory
    ), //I2C3_RX
    (
        stm32::DMA1,
        Stream2,
        Channel3,
        stm32::I2C3,
        PeripheralToMemory
    ), //I2C3_RX:DMA_CHANNEL_3
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
dma_map!(
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        CCR3<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH3
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        CCR3<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH3
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
address!((CCR3<stm32::TIM2>, ccr3), (DMAR<stm32::TIM2>, dmar),);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream5,
        Channel6,
        stm32::I2C3,
        MemoryToPeripheral
    ), //I2C3_TX:DMA_CHANNEL_6
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream6,
        Channel1,
        stm32::I2C1,
        MemoryToPeripheral
    ), //I2C1_TX
    (
        stm32::DMA1,
        Stream7,
        Channel1,
        stm32::I2C1,
        MemoryToPeripheral
    ), //I2C1_TX
    (
        stm32::DMA2,
        Stream3,
        Channel3,
        stm32::SPI1,
        MemoryToPeripheral
    ), //SPI1_TX
    (
        stm32::DMA2,
        Stream5,
        Channel3,
        stm32::SPI1,
        MemoryToPeripheral
    ), //SPI1_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA2,
        Stream0,
        Channel4,
        stm32::SPI4,
        PeripheralToMemory
    ), //SPI4_RX
    (
        stm32::DMA2,
        Stream1,
        Channel4,
        stm32::SPI4,
        MemoryToPeripheral
    ), //SPI4_TX
    (
        stm32::DMA2,
        Stream3,
        Channel5,
        stm32::SPI4,
        PeripheralToMemory
    ), //SPI4_RX:DMA_CHANNEL_5
    (
        stm32::DMA2,
        Stream4,
        Channel5,
        stm32::SPI4,
        MemoryToPeripheral
    ), //SPI4_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::SPI4, dr),);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream0,
        Channel4,
        stm32::UART5,
        PeripheralToMemory
    ), //UART5_RX
    (
        stm32::DMA1,
        Stream2,
        Channel4,
        stm32::UART4,
        PeripheralToMemory
    ), //UART4_RX
    (
        stm32::DMA1,
        Stream4,
        Channel4,
        stm32::UART4,
        MemoryToPeripheral
    ), //UART4_TX
       //(stm32::DMA1, Stream6, Channel7, stm32::DAC, MemoryToPeripheral), //DAC2
);

