jonlamb-gh/stm32f4xx-hal/src/dma.rs
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (stm32::UART4, dr),
    (stm32::UART5, dr),
    //(stm32::DAC, ??),
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        CCR3<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH3
    (
        stm32::DMA1,
        Stream1,
        Channel3,
        CCR3<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH3
    //(stm32::DMA1, Stream2, Channel1, DMAR<stm32::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream2, Channel1, DMAR<stm32::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream4, Channel1, DMAR<stm32::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream4, Channel1, DMAR<stm32::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        stm32::DMA1,
        Stream7,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        stm32::DMA2,
        Stream1,
        Channel7,
        DMAR<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_UP
    (
        stm32::DMA2,
        Stream1,
        Channel7,
        DMAR<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_UP
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR1<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH1
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR1<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH1
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR2<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH2
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR2<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH2
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR3<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH3
    (
        stm32::DMA2,
        Stream2,
        Channel0,
        CCR3<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH3
    (
        stm32::DMA2,
        Stream2,
        Channel7,
        CCR1<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH1
    (
        stm32::DMA2,
        Stream2,
        Channel7,
        CCR1<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH1
    (
        stm32::DMA2,
        Stream3,
        Channel7,
        CCR2<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH2
    (
        stm32::DMA2,
        Stream3,
        Channel7,
        CCR2<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH2
    (
        stm32::DMA2,
        Stream4,
        Channel7,
        CCR3<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH3
    (
        stm32::DMA2,
        Stream4,
        Channel7,
        CCR3<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH3
    (
        stm32::DMA2,
        Stream7,
        Channel7,
        CCR4<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH4
    (
        stm32::DMA2,
        Stream7,
        Channel7,
        CCR4<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH4
    (
        stm32::DMA2,
        Stream7,
        Channel7,
        DMAR<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_COM/TRIG
    (
        stm32::DMA2,
        Stream7,
        Channel7,
        DMAR<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_COM/TRIG
    (
        stm32::DMA1,
        Stream1,
        Channel4,
        stm32::USART3,
        PeripheralToMemory
    ), //USART3_RX
    (
        stm32::DMA1,
        Stream3,
        Channel4,
        stm32::USART3,
        MemoryToPeripheral
    ), //USART3_TX
    (
        stm32::DMA1,
        Stream4,
        Channel7,
        stm32::USART3,
        MemoryToPeripheral
    ), //USART3_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM8>, ccr1),
    (CCR2<stm32::TIM8>, ccr2),
    (CCR3<stm32::TIM8>, ccr3),
    (CCR4<stm32::TIM8>, ccr4),
    (DMAR<stm32::TIM8>, dmar),
    (CCR3<stm32::TIM2>, ccr3),
    (DMAR<stm32::TIM2>, dmar),
    //(DMAR<stm32::TIM7>, dmar), //Missing?
    (stm32::USART3, dr),
);

/* DMAR register appears to be missing from TIM6 derived timers on these devices
   Not sure how _UP is supposed to work without DMAR or if this is just an SVD issue
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (stm32::DMA1, Stream1, Channel7, DMAR<stm32::TIM6>, MemoryToPeripheral), //TIM6_UP
    (stm32::DMA1, Stream1, Channel7, DMAR<stm32::TIM6>, PeripheralToMemory), //TIM6_UP
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (DMAR<stm32::TIM6>, dmar),
);
*/

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream2,
        Channel3,
        stm32::I2C3,
        PeripheralToMemory
    ), //I2C3_RX
    (
        stm32::DMA2,
        Stream5,
        Channel2,
        stm32::CRYP,
        PeripheralToMemory
    ), //CRYP_OUT
    (
        stm32::DMA2,
        Stream6,
        Channel2,
        stm32::CRYP,
        MemoryToPeripheral
    ), //CRYP_IN
    (
        stm32::DMA2,
        Stream7,
        Channel2,
        stm32::HASH,
        MemoryToPeripheral
    ), //HASH_IN
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::HASH, din), (stm32::CRYP, din),);

/* Not sure how DAC works with DMA
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (stm32::DMA1, Stream5, Channel7, stm32::DAC, MemoryToPeripheral), //DAC1
);
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (stm32::DAC, ??),
);
*/

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream7,
        Channel4,
        stm32::UART5,
        MemoryToPeripheral
    ), //UART5_TX
    (
        stm32::DMA2,
        Stream0,
        Channel2,
        stm32::ADC3,
        PeripheralToMemory
    ), //ADC3
    (
        stm32::DMA2,
        Stream1,
        Channel1,
        stm32::DCMI,
        PeripheralToMemory
    ), //DCMI
    (
        stm32::DMA2,
        Stream1,
        Channel2,
        stm32::ADC3,
        PeripheralToMemory
    ), //ADC3
    (
        stm32::DMA2,
        Stream2,
        Channel1,
        stm32::ADC2,
        PeripheralToMemory
    ), //ADC2
    (
        stm32::DMA2,
        Stream3,
        Channel1,
        stm32::ADC2,
        PeripheralToMemory
    ), //ADC2
    (
        stm32::DMA2,
        Stream7,
        Channel1,
        stm32::DCMI,
        PeripheralToMemory
    ), //DCMI
);
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::ADC2, dr), (stm32::ADC3, dr), (stm32::DCMI, dr),);

