jonlamb-gh/stm32f4xx-hal/src/dma.rs
/* FMPI2C missing from peripheral crates
#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (stm32::DMA1, Stream0, Channel7, stm32::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX
    (stm32::DMA1, Stream1, Channel2, stm32::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX
    (stm32::DMA1, Stream3, Channel1, stm32::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX:DMA_CHANNEL_1
    (stm32::DMA1, Stream7, Channel4, stm32::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX:DMA_CHANNEL_4
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
address!(
    (stm32::FMPI2C1, dr),
);
*/

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream1,
        Channel0,
        stm32::I2C1,
        MemoryToPeripheral
    ), //I2C1_TX
    (
        stm32::DMA1,
        Stream6,
        Channel1,
        stm32::I2C1,
        MemoryToPeripheral
    ), //I2C1_TX:DMA_CHANNEL_1
    (
        stm32::DMA1,
        Stream7,
        Channel1,
        stm32::I2C1,
        MemoryToPeripheral
    ), //I2C1_TX:DMA_CHANNEL_1
    (
        stm32::DMA1,
        Stream7,
        Channel6,
        stm32::USART2,
        PeripheralToMemory
    ), //USART2_RX:DMA_CHANNEL_6
    (
        stm32::DMA2,
        Stream2,
        Channel2,
        stm32::SPI1,
        MemoryToPeripheral
    ), //SPI1_TX
    (
        stm32::DMA2,
        Stream3,
        Channel3,
        stm32::SPI1,
        MemoryToPeripheral
    ), //SPI1_TX:DMA_CHANNEL_3
    (
        stm32::DMA2,
        Stream5,
        Channel3,
        stm32::SPI1,
        MemoryToPeripheral
    ), //SPI1_TX:DMA_CHANNEL_3
    (
        stm32::DMA2,
        Stream5,
        Channel5,
        stm32::SPI5,
        MemoryToPeripheral
    ), //SPI5_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA2,
        Stream3,
        Channel2,
        stm32::SPI5,
        PeripheralToMemory
    ), //SPI5_RX
    (
        stm32::DMA2,
        Stream4,
        Channel2,
        stm32::SPI5,
        MemoryToPeripheral
    ), //SPI5_TX
    (
        stm32::DMA2,
        Stream5,
        Channel7,
        stm32::SPI5,
        PeripheralToMemory
    ), //SPI5_RX:DMA_CHANNEL_7
    (
        stm32::DMA2,
        Stream6,
        Channel7,
        stm32::SPI5,
        MemoryToPeripheral
    ), //SPI5_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::SPI5, dr),);

#[cfg(any(
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (
        stm32::DMA2,
        Stream4,
        Channel4,
        stm32::SPI4,
        PeripheralToMemory
    ), //SPI4_RX
);

/* DFSDM1 appears to be missing from SVD
#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (stm32::DMA2, Stream0, Channel7, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0
    (stm32::DMA2, Stream1, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (stm32::DMA2, Stream4, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (stm32::DMA2, Stream6, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0:DMA_CHANNEL_3
);
#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
address!(
    (stm32::DFSDM1, dr),
);
*/

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA2,
        Stream7,
        Channel3,
        stm32::QUADSPI,
        MemoryToPeripheral
    ), //QUADSPI
    (
        stm32::DMA2,
        Stream7,
        Channel3,
        stm32::QUADSPI,
        PeripheralToMemory
    ), //QUADSPI
);

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::QUADSPI, dr),);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA1,
        Stream0,
        Channel5,
        stm32::UART8,
        MemoryToPeripheral
    ), //UART8_TX
    (
        stm32::DMA1,
        Stream1,
        Channel5,
        stm32::UART7,
        MemoryToPeripheral
    ), //UART7_TX
    (
        stm32::DMA1,
        Stream3,
        Channel5,
        stm32::UART7,
        PeripheralToMemory
    ), //UART7_RX
    (
        stm32::DMA1,
        Stream6,
        Channel5,
        stm32::UART8,
        PeripheralToMemory
    ), //UART8_RX
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::UART7, dr), (stm32::UART8, dr),);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_map!(
    (
        stm32::DMA1,
        Stream7,
        Channel8,
        stm32::UART5,
        MemoryToPeripheral
    ), //UART5_TX
    (
        stm32::DMA2,
        Stream0,
        Channel1,
        stm32::UART9,
        MemoryToPeripheral
    ), //UART9_TX
    (
        stm32::DMA2,
        Stream0,
        Channel5,
        stm32::UART10,
        PeripheralToMemory
    ), //UART10_RX
    (
        stm32::DMA2,
        Stream3,
        Channel9,
        stm32::UART10,
        PeripheralToMemory
    ), //UART10_RX:DMA_CHANNEL_9
    (
        stm32::DMA2,
        Stream5,
        Channel9,
        stm32::UART10,
        MemoryToPeripheral
    ), //UART10_TX
    (
        stm32::DMA2,
        Stream7,
        Channel0,
        stm32::UART9,
        PeripheralToMemory
    ), //UART9_RX
    (
        stm32::DMA2,
        Stream7,
        Channel6,
        stm32::UART10,
        MemoryToPeripheral
    ), //UART10_TX:DMA_CHANNEL_6
       //(stm32::DMA2, Stream0, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
       //(stm32::DMA2, Stream1, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
       //(stm32::DMA2, Stream2, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
       //(stm32::DMA2, Stream3, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
       //(stm32::DMA2, Stream4, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
       //(stm32::DMA2, Stream5, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
       //(stm32::DMA2, Stream6, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
       //(stm32::DMA2, Stream7, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
       //(stm32::DMA2, Stream6, Channel2, IN<stm32::AES>, MemoryToPeripheral), //AES_IN
       //(stm32::DMA2, Stream5, Channel2, OUT<stm32::AES>, PeripheralToMemory), //AES_OUT
);

