jonlamb-gh/stm32f4xx-hal/src/dma.rs
#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
address!(
    //(IN<stm32::AES>, dinr),
    //(OUT<stm32::AES>, doutr),
    (stm32::UART9, dr),
    (stm32::UART10, dr),
);

/* Not sure how SAI works
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (stm32::DMA2, Stream1, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_A
    (stm32::DMA2, Stream1, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_A
    (stm32::DMA2, Stream3, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_A
    (stm32::DMA2, Stream3, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_A
    (stm32::DMA2, Stream4, Channel1, stm32::SAI, MemoryToPeripheral), //SAI1_B
    (stm32::DMA2, Stream4, Channel1, stm32::SAI, PeripheralToMemory), //SAI1_B
    (stm32::DMA2, Stream5, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_B:DMA_CHANNEL_0
    (stm32::DMA2, Stream5, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_B:DMA_CHANNEL_0
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (stm32::SAI, dr),
);
*/

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        stm32::DMA2,
        Stream5,
        Channel1,
        stm32::SPI6,
        MemoryToPeripheral
    ), //SPI6_TX
    (
        stm32::DMA2,
        Stream6,
        Channel1,
        stm32::SPI6,
        PeripheralToMemory
    ), //SPI6_RX
);

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::SPI6, dr),);

/*
#[cfg(any(
    feature = "stm32f446",
))]
dma_map!(
    (stm32::DMA1, Stream1, Channel0, stm32::SPDIFRX, PeripheralToMemory), //SPDIF_RX_DT
    (stm32::DMA1, Stream2, Channel2, stm32::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX
    (stm32::DMA1, Stream5, Channel2, stm32::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX
    (stm32::DMA1, Stream6, Channel0, stm32::SPDIFRX, PeripheralToMemory), //SPDIF_RX_CS
    (stm32::DMA2, Stream4, Channel3, stm32::SAI2, MemoryToPeripheral), //SAI2_A
    (stm32::DMA2, Stream4, Channel3, stm32::SAI2, PeripheralToMemory), //SAI2_A
    (stm32::DMA2, Stream6, Channel3, stm32::SAI2, MemoryToPeripheral), //SAI2_B
    (stm32::DMA2, Stream6, Channel3, stm32::SAI2, PeripheralToMemory), //SAI2_B
    (stm32::DMA2, Stream7, Channel0, stm32::SAI2, MemoryToPeripheral), //SAI2_B:DMA_CHANNEL_0
    (stm32::DMA2, Stream7, Channel0, stm32::SAI2, PeripheralToMemory), //SAI2_B:DMA_CHANNEL_0
);
#[cfg(any(
    feature = "stm32f446",
))]
address!(
    (stm32::SPDIFRX, ??),
    (stm32::FMPI2C1, ??),
    (stm32::SAI2, ??),
);
*/
